42crunch.vscode-openapi
alefragnani.bookmarks
alefragnani.project-manager
amazonwebservices.amazon-q-vscode
amazonwebservices.aws-toolkit-vscode
amazonwebservices.codewhisperer-for-command-line-companion
anthropic.claude-code
arjun.swagger-viewer
bierner.markdown-mermaid
biomejs.biome
blackboxapp.blackbox
blackboxapp.blackboxagent
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chunsen.bracket-select
codeium.codeium
continue.continue
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
deque-systems.vscode-axe-linter
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
expo.vscode-expo-tools
figma.figma-vscode-extension
firsttris.vscode-jest-runner
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.codespaces
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
gruntfuggly.todo-tree
hashicorp.terraform
hediet.vscode-drawio
humao.rest-client
inferrinizzard.prettier-sql-vscode
jebbs.plantuml
mhutchie.git-graph
mosapride.zenkaku
mrmlnc.vscode-duplicate
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-kubernetes-tools.vscode-kubernetes-tools
ms-ossdata.vscode-pgsql
ms-playwright.playwright
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
mtxr.sqltools
naumovs.color-highlight
nemesv.copy-file-name
nrwl.angular-console
oderwat.indent-rainbow
orta.vscode-jest
pkief.material-icon-theme
pnp.polacode
postman.postman-for-vscode
pranaygp.vscode-css-peek
prisma.prisma
rangav.vscode-thunder-client
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
rooveterinaryinc.roo-cline
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
steoates.autoimport
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
syler.sass-indented
takumii.markdowntable
theholycoder.swagger-tools
tomoki1207.vscode-input-sequence
usernamehw.errorlens
vincaslt.highlight-matching-tag
vitest.explorer
vscode-icons-team.vscode-icons
vscodevim.vim
wallabyjs.console-ninja
wallabyjs.quokka-vscode
wayou.vscode-todo-highlight
wix.vscode-import-cost
wmaurer.change-case
yoavbls.pretty-ts-errors
yusukehirao.vscode-markuplint
yzhang.markdown-all-in-one
