# Homebrew

# Tap
tap "qmk/qmk"

# Formula
brew "docker"
brew "fish"
brew "git"
brew "git-flow"
brew "mas"
brew "mise"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"
brew "qmk/qmk/qmk"

# Cask
cask "adobe-acrobat-reader"
cask "alfred"
cask "alt-tab"
cask "antigravity"
cask "apidog"
cask "appcleaner"
cask "arc"
cask "biscuit"
cask "bitwarden"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "clipy"
cask "cursor"
cask "dbeaver-community"
cask "ddpm"
cask "deepl"
cask "devtoys"
cask "discord"
cask "displaylink"
cask "docker-desktop"
cask "drawio"
cask "eset-cyber-security"
cask "figma"
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "hhkb"
cask "homerow"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "kiro"
cask "kiro-cli"
cask "mi"
cask "microsoft-edge"
cask "microsoft-onenote"
cask "mongodb-compass"
cask "mos"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "postman"
cask "qmk-toolbox"
cask "send-anywhere"
cask "session-manager-plugin"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "windsurf"
cask "wireshark-app"
cask "zoom"

# Mas
mas "Goodnotes", id: 1444383602
mas "Hidden Bar", id: 1452453066
mas "HiddenMe", id: 467040476
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MenubarX", id: 1575588022
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
